# Data Cleaning Techniques

Course: Advanced Data Mining

Author: Pranav Dinesh

In [3]:
#libraries
import pandas as pd
import numpy as np
data_frame = pd.read_csv("/content/example.csv", na_values = ["n/a", "na", "--"]) #to accept other forms of N/A values

The data is given below ([Source](https://https://github.com/dataoptimal/posts/blob/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv))

In [4]:
print(data_frame)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0
9  100008000.0   213.0     TREMONT            Y           1.0        1     NaN

## Step 1: Removal of Duplicate Tuples

Observe that tuple 9 in the data is a duplicate. We can remove it before it influences techniques that uses measures of central tendencies

In [5]:
data_frame.drop_duplicates(keep = 'first', inplace = True)
print(data_frame)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

## Step 2: Missing Value Replacement

The first step is to detect the missing values. Missing values are usually represented as "NaN". Such values can then be detected using isNull()

In [6]:
if (data_frame.isnull().values.any()):
  print("Missing values exist")
  print(data_frame.isnull().sum())
else:
  print("Data free from missing values")

Missing values exist
PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    3
NUM_BATH        1
SQ_FT           2
dtype: int64

Different methods of missing value replacement have been demonstrated below:

Observe that the middle value of the field PID is NaN. From pattern, it is obvious that the missing value must be 100005000.

In [7]:
data_frame['PID'].fillna(100005000, inplace=True) 
print(data_frame)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In the field ST_NUM, multiple values are missing. But observe that the data follows a non-decreasing order. To fill in the missing values, we can interpolate the field linearly. However, this method is not guaranteed to be correct since the attribute corresponds to street number.

In [8]:
data_frame['ST_NUM'].interpolate(method ='linear', limit_direction ='forward', inplace = True)
print(data_frame)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0   199.0   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0   210.0  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

The field OWN_OCCUPIED and NUM_BATH also has missing values. We will try replacing them with the commonly occuring value.

In [9]:
data_frame['OWN_OCCUPIED'].fillna(data_frame['OWN_OCCUPIED'].mode()[0], inplace = True)
data_frame['NUM_BATH'].fillna(data_frame['NUM_BATH'].mode()[0], inplace = True)
print(data_frame)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0   199.0   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0        1   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0   210.0  WASHINGTON            Y           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

The missing values of attribute SQ_FT and NUM_BEDROOMS can be replaced using the mean value of the attribute.

In [10]:
data_frame['NUM_BEDROOMS'].fillna(int(data_frame['NUM_BEDROOMS'].mean()), inplace = True)
data_frame['SQ_FT'].fillna(data_frame['SQ_FT'].mean(), inplace = True)
print(data_frame)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5  1100.0
2  100003000.0   199.0   LEXINGTON            N           2.0        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0        1   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           2.0        1   800.0
6  100007000.0   210.0  WASHINGTON            Y           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1  1100.0
8  100009000.0   215.0     TREMONT            Y           2.0        2  1800.0

Observe that the mean(SQ_FT) above is 1100

## Step 3: Noisy Data and Outliers

Observe that both OWN_OCCUPIED and NUM_BATH have data inconsistencies that needs to be resolved.

In [11]:
index = 0
for value in data_frame['OWN_OCCUPIED']:
  if value not in ['Y', 'N']:
    data_frame.loc[index, 'OWN_OCCUPIED'] = data_frame['OWN_OCCUPIED'].mode()[0]
  index += 1
print(data_frame)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5  1100.0
2  100003000.0   199.0   LEXINGTON            N           2.0        1   850.0
3  100004000.0   201.0    BERKELEY            Y           1.0        1   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           2.0        1   800.0
6  100007000.0   210.0  WASHINGTON            Y           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1  1100.0
8  100009000.0   215.0     TREMONT            Y           2.0        2  1800.0

The data in NUM_BATH has inconsistent values, which needs to removed. In the code below, such values have been replaced with 0.0

In [12]:
data_frame['NUM_BATH'] = (pd.to_numeric(data_frame['NUM_BATH'], errors='coerce').fillna(0)) #coerce sets such invalid values to NaN
print(data_frame)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0       1.0  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0       1.5  1100.0
2  100003000.0   199.0   LEXINGTON            N           2.0       1.0   850.0
3  100004000.0   201.0    BERKELEY            Y           1.0       1.0   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0       2.0  1600.0
5  100006000.0   207.0    BERKELEY            Y           2.0       1.0   800.0
6  100007000.0   210.0  WASHINGTON            Y           2.0       0.0   950.0
7  100008000.0   213.0     TREMONT            Y           1.0       1.0  1100.0
8  100009000.0   215.0     TREMONT            Y           2.0       2.0  1800.0

However, observe that the attribute NUM_BATH is still noisy. This can be resolved using binning methods.

In [13]:
temp = list(data_frame['NUM_BATH'].sort_values())
bins = []
bins.append(temp[0:3])
bins.append(temp[3:6])
bins.append(temp[6:9])
print(bins)
for i in [0, 1, 2]:
  sum = 0
  for j in range(0, 3):
    sum += bins[i][j]
  avg = sum/3
  for j in range(0, 3):
    bins[i][j] = round(avg)

merge = []
for bin in bins:
  merge += bin

[[0.0, 1.0, 1.0], [1.0, 1.0, 1.0], [1.5, 2.0, 2.0]]

In [14]:
data_frame['NUM_BATH'] = merge
print(data_frame)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0         1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0         1  1100.0
2  100003000.0   199.0   LEXINGTON            N           2.0         1   850.0
3  100004000.0   201.0    BERKELEY            Y           1.0         1   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0         1  1600.0
5  100006000.0   207.0    BERKELEY            Y           2.0         1   800.0
6  100007000.0   210.0  WASHINGTON            Y           2.0         2   950.0
7  100008000.0   213.0     TREMONT            Y           1.0         2  1100.0
8  100009000.0   215.0     TREMONT            Y           2.0         2  1800.0

## Step 4: Data Transformation

The attribute SQ_FT could be used while assigning the property a score. To normalize SQ_FT in the range [0, 1], we can use min-max normalization:

In [17]:
max = data_frame['SQ_FT'].max()
min = data_frame['SQ_FT'].min()
diff = max - min
temp = []
for value in data_frame['SQ_FT']:
  v = (value - min)/diff
  temp.append(v)
data_frame['NORM_SQ_FT'] = temp
print(data_frame)

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT  NORM_SQ_FT
0  100001000.0   104.0      PUTNAM  ...        1  1000.0    0.272727
1  100002000.0   197.0   LEXINGTON  ...        1  1100.0    0.363636
2  100003000.0   199.0   LEXINGTON  ...        1   850.0    0.136364
3  100004000.0   201.0    BERKELEY  ...        1   700.0    0.000000
4  100005000.0   203.0    BERKELEY  ...        1  1600.0    0.818182
5  100006000.0   207.0    BERKELEY  ...        1   800.0    0.090909
6  100007000.0   210.0  WASHINGTON  ...        2   950.0    0.227273
7  100008000.0   213.0     TREMONT  ...        2  1100.0    0.363636
8  100009000.0   215.0     TREMONT  ...        2  1800.0    1.000000

[9 rows x 8 columns]